datasets/hcc/opendj-sdk/queries/long/5222.txt

Found using OpenDJ 6.5.0 rev 12d87b28280.

In some DSML tests we do some valid add requests using for instance the following SOAP request:

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <addRequest dn="uid=foo11, ou=People, o=dsmlfe.com">
        <attr name="labeleduri">
        <value>This is an ExamPle laBeledURI</value>
        </attr>
        <attr name="mail">
        <value>foo11@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 111 1111</value>
        </attr>
        <attr name="cn">
        <value>foo 11</value>
        </attr>
        <attr name="uid">
        <value>foo11</value>
        </attr>
        <attr name="roomnumber">
        <value>a1</value>
        </attr>
        <attr name="sn">
        <value>11</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 111 1111</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>



And we get the following error in the SOAP response:

   <SOAP-ENV:Body>
    <batchResponse xmlns="urn:oasis:names:tc:DSML:2:0:core">
      <addResponse>
        <resultCode code="65" descr="objectClassViolation"/>
        <errorMessage>Entry "uid=foo11,ou=People,o=dsmlfe.com" violates the schema because it contains an unrecognized object class "[top, person, organizationalPerson, inetOrgPerson]"</errorMessage>
       </addResponse>
    </batchResponse>
  </SOAP-ENV:Body>



And we get the following error in the SOAP response:

   <SOAP-ENV:Body>
    <batchResponse xmlns="urn:oasis:names:tc:DSML:2:0:core">
      <addResponse>
        <resultCode code="0" descr="success"/>
       </addResponse>
    </batchResponse>
  </SOAP-ENV:Body>



To reproduce the issue:

./run-pybot.py -s dsml_group.04addmodadd -t add050 DJ

